# 1. 문제
# (핵심) 부등호 순서를 만족하는 최대 최소를 찾아야 함

# 1.1 세부조건
# - 모든 숫자는 달라야함. (한 번 씩만 사용가능)

# 2. 포인트 - 해결 아이디어
# - 최대가 되려면???
# --- 숫자를 큰 수 부터 뽑아가면서 부등호를 만족할 수 있을지를 체크한다.
# ex. 2 < >
# 9 < ? 9보다 더 큰 수가 없기 때문에 8로 내려감
# 8 < 9 만족할 수 있기 때문에 다음 부등호 체크
# 9 > 7 만족하기 때문에 끝

# 3. 플로우
# 숫자 배열을 하나 만들고 사용한 수는 제외시켜 나간다.
# 큰 수 부터 체크
# 작은 수 부터 체크
# 두 가지 경우를 생각한다.


n = int(input())
signs = list(input().split())
numbers = [num for num in range(9)]
max_num, min_num = [], []
cursor = 0

while n:
  # 적절한 솔루션이 생각이 나지 않네요...
